# mark

In [1]:
import numpy as np
import pandas as pd

In [4]:
obj=pd.Series([4, 5, 1, 2])
print(obj)
print(obj.values)
print(obj.index)

0    4
1    5
2    1
3    2
dtype: int64
[4 5 1 2]
RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2=pd.Series([4, 5, 1, 2], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    5
a    1
c    2
dtype: int64

In [8]:
obj2['a']
obj2['d']=6
obj2

d    6
b    5
a    1
c    2
dtype: int64

In [10]:
obj2[['c', 'b', 'a']]

c    2
b    5
a    1
dtype: int64

In [12]:
obj2[obj2>1]

d    6
b    5
c    2
dtype: int64

In [13]:
obj2*2

d    12
b    10
a     2
c     4
dtype: int64

In [15]:
np.exp(obj2)
np.max(obj2)

6

In [16]:
'b' in obj2

True

In [26]:
cdata={'Seoul' :1000, 'Incheon':200, 'Busan':300, 'Gwangju':100}
cdata
obj3=pd.Series(cdata)
obj3

Seoul      1000
Incheon     200
Busan       300
Gwangju     100
dtype: int64

In [28]:
cdata2=['Suwon', 'Incheon', 'Busan', 'Gwangju']
obj4=pd.Series(cdata, index=cdata2)
obj4

pd.isnull(obj4)

Suwon       True
Incheon    False
Busan      False
Gwangju    False
dtype: bool

In [29]:
obj3

Seoul      1000
Incheon     200
Busan       300
Gwangju     100
dtype: int64

In [30]:
obj4

Suwon        NaN
Incheon    200.0
Busan      300.0
Gwangju    100.0
dtype: float64

In [31]:
obj3+obj4

Busan      600.0
Gwangju    200.0
Incheon    400.0
Seoul        NaN
Suwon        NaN
dtype: float64

In [35]:
obj4.name='population'
obj4
obj4.index.name='city'
obj4

city
Suwon        NaN
Incheon    200.0
Busan      300.0
Gwangju    100.0
Name: population, dtype: float64

In [37]:
obj.index=['k', 'a', 'n', 'g']
obj

k    4
a    5
n    1
g    2
dtype: int64

In [39]:
a=[1, 2, 3.14, 'a']
a
arr=np.array(a)
arr

array(['1', '2', '3.14', 'a'], dtype='<U32')

In [46]:
data={'city':['Seoul', 'Daegu', 'Busan', 'Gwangju'], 'year':[2000, 2001, 2003, 2002], 'pop':[9, 2, 3, 0.1]}
df=pd.DataFrame(data)
df.city
df['city']
print(type(df))
print(type(df['city']))
df['pop']

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

0    9.0
1    2.0
2    3.0
3    0.1
Name: pop, dtype: float64

In [47]:
df

      city  year  pop
0    Seoul  2000  9.0
1    Daegu  2001  2.0
2    Busan  2003  3.0
3  Gwangju  2002  0.1

In [58]:
df2=pd.DataFrame(data, columns=['year', 'city', 'pop', 'location'], index=['one', 'two','three', 'four'])
df2

       year     city  pop location
one    2000    Seoul  9.0      NaN
two    2001    Daegu  2.0      NaN
three  2003    Busan  3.0      NaN
four   2002  Gwangju  0.1      NaN

In [61]:
df2['year']
df2.loc['two']
df2.loc['one']
df2.iloc[3]

year           2002
city        Gwangju
pop             0.1
location        NaN
Name: four, dtype: object

In [64]:
df2['location']=126.0
df2['location']=np.arange(4)
df2

       year     city  pop  location
one    2000    Seoul  9.0         0
two    2001    Daegu  2.0         1
three  2003    Busan  3.0         2
four   2002  Gwangju  0.1         3

In [67]:
val=pd.Series([10, 12], index=['one', 'three'])
val
df2['location']=val
df2

       year     city  pop  location
one    2000    Seoul  9.0      10.0
two    2001    Daegu  2.0       NaN
three  2003    Busan  3.0      12.0
four   2002  Gwangju  0.1       NaN

In [71]:
#df2['eastern']
df2['eastern']=(df2.city=='Daegu')|(df2.city=='Busan')
df2

       year     city  pop  location  eastern
one    2000    Seoul  9.0      10.0    False
two    2001    Daegu  2.0       NaN     True
three  2003    Busan  3.0      12.0     True
four   2002  Gwangju  0.1       NaN    False

In [72]:
df2.columns
del df2['eastern']
df2

       year     city  pop  location
one    2000    Seoul  9.0      10.0
two    2001    Daegu  2.0       NaN
three  2003    Busan  3.0      12.0
four   2002  Gwangju  0.1       NaN

In [73]:
pop={'Jeonju':[10,20,30]}
df4=pd.DataFrame(pop)
df4

   Jeonju
0      10
1      20
2      30

In [77]:
pop={'Jeonju':{2001:30, 2002:35}, 'Daejeon':{2001:80, 2020:90}}
df5=pd.DataFrame(pop)
df5

      Jeonju  Daejeon
2001    30.0     80.0
2002    35.0      NaN
2020     NaN     90.0

In [79]:
df5.index.name='year'
df5.columns.name='city'
df5

city  Jeonju  Daejeon
year
2001    30.0     80.0
2002    35.0      NaN
2020     NaN     90.0

In [80]:
df5.values

array([[30., 80.],
       [35., nan],
       [nan, 90.]])

In [85]:
obj=pd.Series(range(11,14), index=['a', 'b', 'c'])
index=obj.index
index[1:]

Index(['b', 'c'], dtype='object')

In [87]:
labels=pd.Index(np.arange(100, 103))
labels

Int64Index([100, 101, 102], dtype='int64')

In [90]:
obj2=pd.Series([1.0, -2.0, 0], index=labels)
obj2.index is labels

True

In [95]:
'city' in df2.columns
'one' in df2.index

True

In [97]:
obj=pd.Series([4.1, 7.1, -5.5, 3.3], index=['d','b','a', 'c'])
obj2=obj.reindex(['a','b','c','d','e'])
obj2

a   -5.5
b    7.1
c    3.3
d    4.1
e    NaN
dtype: float64

In [102]:
obj3=pd.Series(['data1', 'data2', 'data3'], index=[0, 2, 4])
obj3.reindex(range(5), method='ffill')
obj3.reindex(range(5), method='bfill')

0    data1
1    data2
2    data2
3    data3
4    data3
dtype: object

In [107]:
df.loc[[0, 2, 3], ['city', 'pop']]

      city  pop
0    Seoul  9.0
2    Busan  3.0
3  Gwangju  0.1

In [110]:
obj=pd.Series(np.arange(11, 16), index=['a','b','c','d','e'])
obj

a    11
b    12
c    13
d    14
e    15
dtype: int32

In [111]:
del obj['c']

In [113]:
obj
newobj=obj.drop('b')
newobj

a    11
d    14
e    15
dtype: int32

In [119]:
data=pd.DataFrame(np.arange(16).reshape((4,4)), index=['Seoul', 'Busan', 'Gwangju', 'Jeju'], columns=['one', 'two', 'three', 'four'])
data

         one  two  three  four
Seoul      0    1      2     3
Busan      4    5      6     7
Gwangju    8    9     10    11
Jeju      12   13     14    15

In [115]:
data.drop(['Gwangju', 'Busan'])

       one  two  three  four
Seoul    0    1      2     3
Jeju    12   13     14    15

In [118]:
data.drop('two', axis=1)

         one  three  four
Seoul      0      2     3
Busan      4      6     7
Gwangju    8     10    11
Jeju      12     14    15

In [120]:
data.drop('two', axis='columns', inplace=True)

In [121]:
data

         one  three  four
Seoul      0      2     3
Busan      4      6     7
Gwangju    8     10    11
Jeju      12     14    15

In [136]:
df=pd.read_csv("test_csv_file.csv")
type(df)
df

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36

In [129]:
pd.read_csv("test_text_file.txt", sep="|", index_col='ID')

    A  B  C  D
ID
C1  1  2  3  4
C2  5  6  7  8
C3  1  3  5  7

In [128]:
pd.read_csv("gapminder.tsv", sep="\t")

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [135]:
pd.read_csv("text_without_column_name.txt", sep="|", header=None, names=['ID', 'A', 'B', 'C', 'D'], index_col='ID')

    A  B  C  D
ID
C1  1  2  3  4
C2  5  6  7  8
C3  1  3  5  7

In [143]:
pd.read_csv("test_csv_file.csv", skiprows=[1, 4])

   ID LAST_NAME  AGE
0   2      CHOI   25
1   3       LEE   41
2   5       LIM   36

In [147]:
df=pd.read_csv("test_text_file.txt", sep="|", na_values=['ì—†ìŒ', '??', 'ëª¨ë¦„'])
print(df)
df.info()

   ID    A    B  C    D
0  C1  1.0  2.0  3  NaN
1  C2  NaN  6.0  7  8.0
2  C3  1.0  NaN  5  7.0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      3 non-null      object
 1   A       2 non-null      float64
 2   B       2 non-null      float64
 3   C       3 non-null      int64
 4   D       2 non-null      float64
dtypes: float64(3), int64(1), object(1)
memory usage: 248.0+ bytes